In [2]:
import pandas as pd
import numpy as np

In [19]:
data = {'name': ['Alice', 'Bob', 'Charlie'],
        'age': [25, np.nan, 30],
        'gender': ['F', 'M', 'M'],
        'income': [50000, 60000, np.nan]}

In [20]:
df = pd.DataFrame(data)
df

      name   age gender   income
0    Alice  25.0      F  50000.0
1      Bob   NaN      M  60000.0
2  Charlie  30.0      M      NaN

In [4]:
#Verifica si un elemento del df es null
print(df.isnull())

    name    age  gender  income
0  False  False   False   False
1  False   True   False   False
2  False  False   False    True

In [5]:
#Cuenta el numero de valores nulos por columna, como un grup by count
print(df.isnull().sum())

name      0
age       1
gender    0
income    1
dtype: int64

In [14]:
#df.dropna() retorna un df con tuplas que no contengan valores nulos, esta nueva tupla se
#puede almacenar en otro df
df_filtro = df.dropna()

In [16]:
df

      name   age gender   income
0    Alice  25.0      F  50000.0
1      Bob   NaN      M  60000.0
2  Charlie  30.0      M      NaN

In [22]:
#Llenado de valores nulos con un valor especifico
df_fill = df.fillna(555)
df_fill

      name    age gender   income
0    Alice   25.0      F  50000.0
1      Bob  555.0      M  60000.0
2  Charlie   30.0      M    555.0

In [24]:
df_fill_mean = df.fillna(df.mean())
df_fill_mean

C:\Users\hsu\AppData\Local\Temp\ipykernel_15844\626587301.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df_fill_mean = df.fillna(df.mean())

      name   age gender   income
0    Alice  25.0      F  50000.0
1      Bob  27.5      M  60000.0
2  Charlie  30.0      M  55000.0

In [17]:
#obtiene un df eliminando las columnas que contengan valores nulos
df.dropna(axis=1)

      name gender
0    Alice      F
1      Bob      M
2  Charlie      M

In [25]:
#La imputación es una técnica para estimar valores faltantes basada en datos observados. 
#En Pandas, podemos usar el paquete scikit-learn para realizar la imputación.

from sklearn.impute import SimpleImputer
imp = SimpleImputer(missing_values=np.nan, strategy='mean')

df[['age', 'income']] = imp.fit_transform(df[['age', 'income']])

In [26]:
df

      name   age gender   income
0    Alice  25.0      F  50000.0
1      Bob  27.5      M  60000.0
2  Charlie  30.0      M  55000.0

In [23]:
df

      name   age gender   income
0    Alice  25.0      F  50000.0
1      Bob   NaN      M  60000.0
2  Charlie  30.0      M      NaN